experiments/k6/k6-2/out.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./configs/k6/open/script.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 10 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 21619 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m01.0s/1m0s

running (0m02.0s), 10/10 VUs, 44291 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m02.0s/1m0s

running (0m03.0s), 10/10 VUs, 67819 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m03.0s/1m0s

running (0m04.0s), 10/10 VUs, 91510 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m04.0s/1m0s

running (0m05.0s), 10/10 VUs, 115582 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m05.0s/1m0s

running (0m06.0s), 10/10 VUs, 141489 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m06.0s/1m0s

running (0m07.0s), 10/10 VUs, 166574 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m07.0s/1m0s

running (0m08.0s), 10/10 VUs, 192516 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m08.0s/1m0s

running (0m09.0s), 10/10 VUs, 218496 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m09.0s/1m0s

running (0m10.0s), 10/10 VUs, 245197 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m10.0s/1m0s

running (0m11.0s), 10/10 VUs, 273414 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m11.0s/1m0s

running (0m12.0s), 10/10 VUs, 300299 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  0m12.0s/1m0s

running (0m13.0s), 10/10 VUs, 327397 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  0m13.0s/1m0s

running (0m14.0s), 10/10 VUs, 353634 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  0m14.0s/1m0s

running (0m15.0s), 10/10 VUs, 379690 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  0m15.0s/1m0s

running (0m16.0s), 10/10 VUs, 408574 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  0m16.0s/1m0s

running (0m17.0s), 10/10 VUs, 436137 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  0m17.0s/1m0s

running (0m18.0s), 10/10 VUs, 463203 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  0m18.0s/1m0s

running (0m19.0s), 10/10 VUs, 491497 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  0m19.0s/1m0s

running (0m20.0s), 10/10 VUs, 518356 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  0m20.0s/1m0s

running (0m21.0s), 10/10 VUs, 546655 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  0m21.0s/1m0s

running (0m22.0s), 10/10 VUs, 574601 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  0m22.0s/1m0s

running (0m23.0s), 10/10 VUs, 602158 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  0m23.0s/1m0s

running (0m24.0s), 10/10 VUs, 630389 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  0m24.0s/1m0s

running (0m25.0s), 10/10 VUs, 658237 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  0m25.0s/1m0s

running (0m26.0s), 10/10 VUs, 685855 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  0m26.0s/1m0s

running (0m27.0s), 10/10 VUs, 716190 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  0m27.0s/1m0s

running (0m28.0s), 10/10 VUs, 743861 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  0m28.0s/1m0s

running (0m29.0s), 10/10 VUs, 772029 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  0m29.0s/1m0s

running (0m30.0s), 10/10 VUs, 800573 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  0m30.0s/1m0s

running (0m31.0s), 10/10 VUs, 829740 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  0m31.0s/1m0s

running (0m32.0s), 10/10 VUs, 859367 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  0m32.0s/1m0s

running (0m33.0s), 10/10 VUs, 887858 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  0m33.0s/1m0s

running (0m34.0s), 10/10 VUs, 917287 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  0m34.0s/1m0s

running (0m35.0s), 10/10 VUs, 945878 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  0m35.0s/1m0s

running (0m36.0s), 10/10 VUs, 974022 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  0m36.0s/1m0s

running (0m37.0s), 10/10 VUs, 1005713 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  0m37.0s/1m0s

running (0m38.0s), 10/10 VUs, 1035052 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  0m38.0s/1m0s

running (0m39.0s), 10/10 VUs, 1063219 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  0m39.0s/1m0s

running (0m40.0s), 10/10 VUs, 1091716 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  0m40.0s/1m0s

running (0m41.0s), 10/10 VUs, 1120780 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  0m41.0s/1m0s

running (0m42.0s), 10/10 VUs, 1151470 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  0m42.0s/1m0s

running (0m43.0s), 10/10 VUs, 1180165 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  0m43.0s/1m0s

running (0m44.0s), 10/10 VUs, 1209899 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  0m44.0s/1m0s

running (0m45.0s), 10/10 VUs, 1239435 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  0m45.0s/1m0s

running (0m46.0s), 10/10 VUs, 1268812 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  0m46.0s/1m0s

running (0m47.0s), 10/10 VUs, 1297659 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  0m47.0s/1m0s

running (0m48.0s), 10/10 VUs, 1327256 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  0m48.0s/1m0s

running (0m49.0s), 10/10 VUs, 1357076 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  0m49.0s/1m0s

running (0m50.0s), 10/10 VUs, 1385809 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  0m50.0s/1m0s

running (0m51.0s), 10/10 VUs, 1414691 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  0m51.0s/1m0s

running (0m52.0s), 10/10 VUs, 1443863 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  0m52.0s/1m0s

running (0m53.0s), 10/10 VUs, 1474715 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  0m53.0s/1m0s

running (0m54.0s), 10/10 VUs, 1504305 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  0m54.0s/1m0s

running (0m55.0s), 10/10 VUs, 1533580 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  0m55.0s/1m0s

running (0m56.0s), 10/10 VUs, 1562598 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  0m56.0s/1m0s

running (0m57.0s), 10/10 VUs, 1592143 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  0m57.0s/1m0s

running (0m58.0s), 10/10 VUs, 1625022 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  0m58.0s/1m0s

running (0m59.0s), 10/10 VUs, 1654330 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  0m59.0s/1m0s

running (1m00.0s), 10/10 VUs, 1682545 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  1m00.0s/1m0s

running (1m00.0s), 00/10 VUs, 1682635 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  1m0s

     data_received..................: 1.4 GB  24 MB/s
     data_sent......................: 130 MB  2.2 MB/s
     http_req_blocked...............: avg=9.38µs   min=2.05µs   med=5.54µs   max=7.85ms  p(90)=8.91µs   p(95)=10.08µs 
     http_req_connecting............: avg=1.91µs   min=0s       med=0s       max=1.58ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=244.42µs min=107.99µs med=233.53µs max=28.48ms p(90)=300.34µs p(95)=328.69µs
       { expected_response:true }...: avg=244.42µs min=107.99µs med=233.53µs max=28.48ms p(90)=300.34µs p(95)=328.69µs
     http_req_failed................: 0.00%   0 out of 1682635
     http_req_receiving.............: avg=53.98µs  min=14.75µs  med=48.57µs  max=28.35ms p(90)=70.42µs  p(95)=78.06µs 
     http_req_sending...............: avg=17.12µs  min=5.88µs   med=14.48µs  max=7.71ms  p(90)=22.2µs   p(95)=25.63µs 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=173.31µs min=76.53µs  med=165.04µs max=4.5ms   p(90)=224.86µs p(95)=248.98µs
     http_reqs......................: 1682635 28043.708989/s
     iteration_duration.............: avg=337.15µs min=148.78µs med=320.2µs  max=29.02ms p(90)=400.63µs p(95)=440.77µs
     iterations.....................: 1682635 28043.708989/s
     vus............................: 10      min=10           max=10
     vus_max........................: 10      min=10           max=10


running (1m00.0s), 00/10 VUs, 1682635 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  1m0s